//=============================================
//
//エネミーのステートパターン[enemy_state.cpp]
//Auther Matsuda Towa
//
//=============================================
#include "enemy_state.h"

//=============================================
//エネミーの移動
//=============================================
void CEnemyState::Move(CEnemy* enemy)
{
}
//=============================================
//エネミーの移動状態(雑魚敵のみ) TODO:ならステートパターン組み換えよう
//=============================================
void CEnemyMoveState::Move(CEnemy* enemy)
{
	enemy->m_pMove->Move(enemy);
}
