//=============================================
//
//スモーク処理[tactical_somoke.cpp]
//Auther Matsuda Towa
//
//=============================================
#include "tactical_smoke.h"
#include "manager.h"

//カラー面接
const D3DXCOLOR CTacticalSmoke::COLOR = { 1.0f,1.0f,1.0f,1.0f };

//=============================================
//コンストラクタ
//=============================================
CTacticalSmoke::CTacticalSmoke(int nPriority):CSmoke(nPriority)
{
}

//=============================================
//デストラクタ
//=============================================
CTacticalSmoke::~CTacticalSmoke()
{
}

//=============================================
//初期化
//=============================================
HRESULT CTacticalSmoke::Init()
{
	//親クラスの初期化
	CSmoke::Init();

	//色設定
	SetColor(COLOR);

	return S_OK;
}

//=============================================
//終了
//=============================================
void CTacticalSmoke::Uninit()
{
	//親クラスの終了
	CSmoke::Uninit();
}

//=============================================
//更新
//=============================================
void CTacticalSmoke::Update()
{
	//親クラスの更新
	CSmoke::Update();
}

//=============================================
//描画
//=============================================
void CTacticalSmoke::Draw()
{
	//親クラスの描画
	CSmoke::Draw();
}
