//=============================================
//
//ポーズのUI_リトライ[pause_select_retry.cpp]
//Author Matsuda Towa
//
//=============================================
#include "pause_select_retry.h"

//=============================================
//コンストラクタ
//=============================================
CPauseSelectRetry::CPauseSelectRetry(int nPriority)
{
}

//=============================================
// デストラクタ
//=============================================
CPauseSelectRetry::~CPauseSelectRetry()
{
}

//=============================================
// 初期化
//=============================================
HRESULT CPauseSelectRetry::Init()
{
	CPauseSelect::Init();
	return S_OK;
}

//=============================================
// 終了
//=============================================
void CPauseSelectRetry::Uninit()
{
	CPauseSelect::Uninit();
}

//=============================================
// 更新
//=============================================
void CPauseSelectRetry::Update()
{
	CPauseSelect::Update();
}

//=============================================
// 描画
//=============================================
void CPauseSelectRetry::Draw()
{
	CPauseSelect::Draw();
}
