//=============================================
//
//ポーズのUI_タイトルに[pause_select_quit.cpp]
//Author Matsuda Towa
//
//=============================================
#include "pause_select_quit.h"

//=============================================
//コンストラクタ
//=============================================
CPauseSelectQuit::CPauseSelectQuit(int nPriority)
{
}

//=============================================
// デストラクタ
//=============================================
CPauseSelectQuit::~CPauseSelectQuit()
{
}

//=============================================
// 初期化
//=============================================
HRESULT CPauseSelectQuit::Init()
{
	CPauseSelect::Init();
	return S_OK;
}

//=============================================
// 終了
//=============================================
void CPauseSelectQuit::Uninit()
{
	CPauseSelect::Uninit();
}

//=============================================
// 更新
//=============================================
void CPauseSelectQuit::Update()
{
	CPauseSelect::Update();
}

//=============================================
// 描画
//=============================================
void CPauseSelectQuit::Draw()
{
	CPauseSelect::Draw();
}
